app/controllers/api/v1/helicopters_controller.rb

SELECT "helicopters".* FROM "helicopters"
---
  def index
    @helicopters = Helicopter.all

SELECT "helicopters".* FROM "helicopters" WHERE "helicopters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @helicopter = Helicopter.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "helicopters" ("name", "model", "description", "created_at", "updated_at", "user_id", "avatar") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.find(current_user.id)
    @helicopter = @user.helicopters.new(helicopter_params)
    authorize! :create, @helicopter

    if @helicopter.save

SELECT "helicopters".* FROM "helicopters" WHERE "helicopters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_helicopter
    @helicopter = Helicopter.find(params[:id])