app/controllers/api/v1/reservations_controller.rb

  def index
    @reservations = User.find_by(id: params[:user_id]).reservations
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @user = User.find_by(id: params[:user_id])
    @reservation = @user.reservations.new(reservation_params)
    @reservation.helicopter_id = params[:helicopter_id]

    if @reservation.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reservations" ("date_start", "date_end", "created_at", "updated_at", "user_id", "helicopter_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date_start", "2021-04-17"], ["date_end", "2021-04-18"], ["created_at", "2022-01-19 09:36:41.525437"], ["updated_at", "2022-01-19 09:36:41.525437"], ["user_id", 1], ["helicopter_id", 2]]